fduignan/stm32g030/include/STM32G030.h
/*
 * Copyright (c) 2009-2016 ARM Limited. All rights reserved.
 * 
 * SPDX-License-Identifier: Apache-2.0
 * 
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 * 
 * http://www.apache.org/licenses/LICENSE-2.0
 * 
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * @file     STM32G030.h
 * @brief    CMSIS HeaderFile
 * @version  1.0
 * @date     22. April 2020
 * @note     Generated by SVDConv V3.2.66 on Wednesday, 22.04.2020 20:14:54
 *           from File 'stm32g030.svd',
 *           last modified on Thursday, 29.08.2019 00:09:56
 */



/** @addtogroup 
  * @{
  */


/** @addtogroup STM32G030
  * @{
  */


#ifndef STM32G030_H
#define STM32G030_H

#ifdef __cplusplus
extern "C" {
#endif


/** @addtogroup Configuration_of_CMSIS
  * @{
  */



/* =========================================================================================================================== */
/* ================                                Interrupt Number Definition                                ================ */
/* =========================================================================================================================== */

typedef enum {
/* =======================================  ARM Cortex-M0 Specific Interrupt Numbers  ======================================== */
  Reset_IRQn                = -15,              /*!< -15  Reset Vector, invoked on Power up and warm reset                     */
  NonMaskableInt_IRQn       = -14,              /*!< -14  Non maskable Interrupt, cannot be stopped or preempted               */
  HardFault_IRQn            = -13,              /*!< -13  Hard Fault, all classes of Fault                                     */
  SVCall_IRQn               =  -5,              /*!< -5 System Service Call via SVC instruction                                */
  PendSV_IRQn               =  -2,              /*!< -2 Pendable request for system service                                    */
  SysTick_IRQn              =  -1,              /*!< -1 System Tick Timer                                                      */
/* =========================================  STM32G030 Specific Interrupt Numbers  ========================================== */
  WWDG_IRQn                 =   0,              /*!< 0  Window watchdog interrupt                                              */
  PVD_IRQn                  =   1,              /*!< 1  Power voltage detector interrupt                                       */
  RTC_TAMP_IRQn             =   2,              /*!< 2  RTC and TAMP interrupts                                                */
  FLASH_IRQn                =   3,              /*!< 3  Flash global interrupt                                                 */
  RCC_IRQn                  =   4,              /*!< 4  RCC global interrupt                                                   */
  EXTI0_1_IRQn              =   5,              /*!< 5  EXTI line 0 & 1 interrupt                                              */
  EXTI2_3_IRQn              =   6,              /*!< 6  EXTI line 2 & 3 interrupt                                              */
  EXTI4_15_IRQn             =   7,              /*!< 7  EXTI line 4 to 15 interrupt                                            */
  DMA_Channel1_IRQn         =   9,              /*!< 9  DMA channel 1 interrupt                                                */
  DMA_Channel2_3_IRQn       =  10,              /*!< 10 DMA channel 2 & 3 interrupts                                           */
  DMA_Channel4_5_6_7_IRQn   =  11,              /*!< 11 DMA channel 4, 5, 6 & 7 and DMAMUX                                     */
  ADC_COMP_IRQn             =  12,              /*!< 12 ADC and COMP interrupts                                                */
  TIM1_BRK_UP_TRG_COM_IRQn  =  13,              /*!< 13 TIM1 break, update, trigger                                            */
  TIM1_CC_IRQn              =  14,              /*!< 14 TIM1 Capture Compare interrupt                                         */
  TIM2_IRQn                 =  15,              /*!< 15 TIM2 global interrupt                                                  */
  TIM3_IRQn                 =  16,              /*!< 16 TIM3 global interrupt                                                  */
  TIM14_IRQn                =  19,              /*!< 19 TIM14 global interrupt                                                 */
  TIM16_IRQn                =  21,              /*!< 21 TIM16 global interrupt                                                 */
  TIM17_IRQn                =  22,              /*!< 22 TIM17 global interrupt                                                 */
  I2C1_IRQn                 =  23,              /*!< 23 I2C1 global interrupt                                                  */
  I2C2_IRQn                 =  24,              /*!< 24 I2C2 global interrupt                                                  */
  SPI1_IRQn                 =  25,              /*!< 25 SPI1 global interrupt                                                  */
  SPI2_IRQn                 =  26,              /*!< 26 SPI2 global interrupt                                                  */
  USART1_IRQn               =  27,              /*!< 27 USART1 global interrupt                                                */
  USART2_IRQn               =  28,              /*!< 28 USART2 global interrupt                                                */
  USART3_USART4_LPUART1_IRQn=  29,              /*!< 29 USART3 + USART4 + LPUART1                                              */
  CEC_IRQn                  =  30,              /*!< 30 CEC global interrupt                                                   */
  AES_RNG_IRQn              =  31               /*!< 31 AES and RNG global interrupts                                          */
} IRQn_Type;



/* =========================================================================================================================== */
/* ================                           Processor and Core Peripheral Section                           ================ */
/* =========================================================================================================================== */

/* ===========================  Configuration of the ARM Cortex-M0 Processor and Core Peripherals  =========================== */
#define __CM0_REV                 0x0001U       /*!< CM0 Core Revision                                                         */
#define __NVIC_PRIO_BITS               4        /*!< Number of Bits used for Priority Levels                                   */
#define __Vendor_SysTickConfig         0        /*!< Set to 1 if different SysTick Config is used                              */


/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_cm0.h"                           /*!< ARM Cortex-M0 processor and core peripherals                              */
#include "system_STM32G030.h"                   /*!< STM32G030 System                                                          */

#ifndef __IM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __IM   __I
#endif
#ifndef __OM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __OM   __O
#endif
#ifndef __IOM                                   /*!< Fallback for older CMSIS versions                                         */
  #define __IOM  __IO
#endif


/* ========================================  Start of section using anonymous unions  ======================================== */
#if defined (__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined (__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
  #pragma clang diagnostic ignored "-Wgnu-anonymous-struct"
  #pragma clang diagnostic ignored "-Wnested-anon-types"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning 586
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif


/* =========================================================================================================================== */
/* ================                            Device Specific Peripheral Section                             ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                           IWDG                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Independent watchdog (IWDG)
  */

typedef struct {                                /*!< (@ 0x40003000) IWDG Structure                                             */
  __OM  uint32_t  KR;                           /*!< (@ 0x00000000) Key register                                               */
  __IOM uint32_t  PR;                           /*!< (@ 0x00000004) Prescaler register                                         */
  __IOM uint32_t  RLR;                          /*!< (@ 0x00000008) Reload register                                            */
  __IM  uint32_t  SR;                           /*!< (@ 0x0000000C) Status register                                            */
  __IOM uint32_t  WINR;                         /*!< (@ 0x00000010) Window register                                            */
} IWDG_Type;                                    /*!< Size = 20 (0x14)                                                          */



/* =========================================================================================================================== */
/* ================                                           WWDG                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief System window watchdog (WWDG)
  */

typedef struct {                                /*!< (@ 0x40002C00) WWDG Structure                                             */
  __IOM uint32_t  CR;                           /*!< (@ 0x00000000) Control register                                           */
  __IOM uint32_t  CFR;                          /*!< (@ 0x00000004) Configuration register                                     */
  __IOM uint32_t  SR;                           /*!< (@ 0x00000008) Status register                                            */
} WWDG_Type;                                    /*!< Size = 12 (0xc)                                                           */



/* =========================================================================================================================== */
/* ================                                           FLASH                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Flash (FLASH)
  */

typedef struct {                                /*!< (@ 0x40022000) FLASH Structure                                            */
  __IOM uint32_t  ACR;                          /*!< (@ 0x00000000) Access control register                                    */
  __IM  uint32_t  RESERVED;
  __OM  uint32_t  KEYR;                         /*!< (@ 0x00000008) Flash key register                                         */
  __OM  uint32_t  OPTKEYR;                      /*!< (@ 0x0000000C) Option byte key register                                   */
  __IOM uint32_t  SR;                           /*!< (@ 0x00000010) Status register                                            */
  __IOM uint32_t  CR;                           /*!< (@ 0x00000014) Flash control register                                     */
  __IOM uint32_t  ECCR;                         /*!< (@ 0x00000018) Flash ECC register                                         */
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  OPTR;                         /*!< (@ 0x00000020) Flash option register                                      */
  __IM  uint32_t  PCROP1ASR;                    /*!< (@ 0x00000024) Flash PCROP zone A Start address register                  */
  __IM  uint32_t  PCROP1AER;                    /*!< (@ 0x00000028) Flash PCROP zone A End address register                    */
  __IM  uint32_t  WRP1AR;                       /*!< (@ 0x0000002C) Flash WRP area A address register                          */
  __IM  uint32_t  WRP1BR;                       /*!< (@ 0x00000030) Flash WRP area B address register                          */
  __IM  uint32_t  PCROP1BSR;                    /*!< (@ 0x00000034) Flash PCROP zone B Start address register                  */
  __IM  uint32_t  PCROP1BER;                    /*!< (@ 0x00000038) Flash PCROP zone B End address register                    */
  __IM  uint32_t  RESERVED2[17];
  __IM  uint32_t  SECR;                         /*!< (@ 0x00000080) Flash Security register                                    */
} FLASH_Type;                                   /*!< Size = 132 (0x84)                                                         */



/* =========================================================================================================================== */
/* ================                                            RCC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Reset and clock control (RCC)
  */

