fduignan/stm32g030/include/STM32G030.h
typedef struct {                                /*!< (@ 0x40021000) RCC Structure                                              */
  __IOM uint32_t  CR;                           /*!< (@ 0x00000000) Clock control register                                     */
  __IOM uint32_t  ICSCR;                        /*!< (@ 0x00000004) Internal clock sources calibration register                */
  __IOM uint32_t  CFGR;                         /*!< (@ 0x00000008) Clock configuration register                               */
  __IOM uint32_t  PLLSYSCFGR;                   /*!< (@ 0x0000000C) PLL configuration register                                 */
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  CIER;                         /*!< (@ 0x00000018) Clock interrupt enable register                            */
  __IM  uint32_t  CIFR;                         /*!< (@ 0x0000001C) Clock interrupt flag register                              */
  __OM  uint32_t  CICR;                         /*!< (@ 0x00000020) Clock interrupt clear register                             */
  __IOM uint32_t  IOPRSTR;                      /*!< (@ 0x00000024) GPIO reset register                                        */
  __IOM uint32_t  AHBRSTR;                      /*!< (@ 0x00000028) AHB peripheral reset register                              */
  __IOM uint32_t  APBRSTR1;                     /*!< (@ 0x0000002C) APB peripheral reset register 1                            */
  __IOM uint32_t  APBRSTR2;                     /*!< (@ 0x00000030) APB peripheral reset register 2                            */
  __IOM uint32_t  IOPENR;                       /*!< (@ 0x00000034) GPIO clock enable register                                 */
  __IOM uint32_t  AHBENR;                       /*!< (@ 0x00000038) AHB peripheral clock enable register                       */
  __IOM uint32_t  APBENR1;                      /*!< (@ 0x0000003C) APB peripheral clock enable register 1                     */
  __IOM uint32_t  APBENR2;                      /*!< (@ 0x00000040) APB peripheral clock enable register 2                     */
  __IOM uint32_t  IOPSMENR;                     /*!< (@ 0x00000044) GPIO in Sleep mode clock enable register                   */
  __IOM uint32_t  AHBSMENR;                     /*!< (@ 0x00000048) AHB peripheral clock enable in Sleep mode register         */
  __IOM uint32_t  APBSMENR1;                    /*!< (@ 0x0000004C) APB peripheral clock enable in Sleep mode register
                                                                    1                                                          */
  __IOM uint32_t  APBSMENR2;                    /*!< (@ 0x00000050) APB peripheral clock enable in Sleep mode register
                                                                    2                                                          */
  __IOM uint32_t  CCIPR;                        /*!< (@ 0x00000054) Peripherals independent clock configuration register       */
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  BDCR;                         /*!< (@ 0x0000005C) RTC domain control register                                */
  __IOM uint32_t  CSR;                          /*!< (@ 0x00000060) Control/status register                                    */
} RCC_Type;                                     /*!< Size = 100 (0x64)                                                         */



/* =========================================================================================================================== */
/* ================                                            PWR                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Power control (PWR)
  */

typedef struct {                                /*!< (@ 0x40007000) PWR Structure                                              */
  __IOM uint32_t  CR1;                          /*!< (@ 0x00000000) Power control register 1                                   */
  __IOM uint32_t  CR2;                          /*!< (@ 0x00000004) Power control register 2                                   */
  __IOM uint32_t  CR3;                          /*!< (@ 0x00000008) Power control register 3                                   */
  __IOM uint32_t  CR4;                          /*!< (@ 0x0000000C) Power control register 4                                   */
  __IM  uint32_t  SR1;                          /*!< (@ 0x00000010) Power status register 1                                    */
  __IM  uint32_t  SR2;                          /*!< (@ 0x00000014) Power status register 2                                    */
  __OM  uint32_t  SCR;                          /*!< (@ 0x00000018) Power status clear register                                */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  PUCRA;                        /*!< (@ 0x00000020) Power Port A pull-up control register                      */
  __IOM uint32_t  PDCRA;                        /*!< (@ 0x00000024) Power Port A pull-down control register                    */
  __IOM uint32_t  PUCRB;                        /*!< (@ 0x00000028) Power Port B pull-up control register                      */
  __IOM uint32_t  PDCRB;                        /*!< (@ 0x0000002C) Power Port B pull-down control register                    */
  __IOM uint32_t  PUCRC;                        /*!< (@ 0x00000030) Power Port C pull-up control register                      */
  __IOM uint32_t  PDCRC;                        /*!< (@ 0x00000034) Power Port C pull-down control register                    */
  __IOM uint32_t  PUCRD;                        /*!< (@ 0x00000038) Power Port D pull-up control register                      */
  __IOM uint32_t  PDCRD;                        /*!< (@ 0x0000003C) Power Port D pull-down control register                    */
  __IM  uint32_t  RESERVED1[2];
  __IOM uint32_t  PUCRF;                        /*!< (@ 0x00000048) Power Port F pull-up control register                      */
  __IOM uint32_t  PDCRF;                        /*!< (@ 0x0000004C) Power Port F pull-down control register                    */
} PWR_Type;                                     /*!< Size = 80 (0x50)                                                          */



/* =========================================================================================================================== */
/* ================                                            DMA                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief DMA controller (DMA)
  */

typedef struct {                                /*!< (@ 0x40020000) DMA Structure                                              */
  __IM  uint32_t  ISR;                          /*!< (@ 0x00000000) low interrupt status register                              */
  __IM  uint32_t  IFCR;                         /*!< (@ 0x00000004) high interrupt status register                             */
  __IOM uint32_t  CCR1;                         /*!< (@ 0x00000008) DMA channel x configuration register                       */
  __IOM uint32_t  CNDTR1;                       /*!< (@ 0x0000000C) DMA channel x number of data register                      */
  __IOM uint32_t  CPAR1;                        /*!< (@ 0x00000010) DMA channel x peripheral address register                  */
  __IOM uint32_t  CMAR1;                        /*!< (@ 0x00000014) DMA channel x memory address register                      */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  CCR2;                         /*!< (@ 0x0000001C) DMA channel x configuration register                       */
  __IOM uint32_t  CNDTR2;                       /*!< (@ 0x00000020) DMA channel x number of data register                      */
  __IOM uint32_t  CPAR2;                        /*!< (@ 0x00000024) DMA channel x peripheral address register                  */
  __IOM uint32_t  CMAR2;                        /*!< (@ 0x00000028) DMA channel x memory address register                      */
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  CCR3;                         /*!< (@ 0x00000030) DMA channel x configuration register                       */
  __IOM uint32_t  CNDTR3;                       /*!< (@ 0x00000034) DMA channel x configuration register                       */
  __IOM uint32_t  CPAR3;                        /*!< (@ 0x00000038) DMA channel x peripheral address register                  */
  __IOM uint32_t  CMAR3;                        /*!< (@ 0x0000003C) DMA channel x memory address register                      */
  __IM  uint32_t  RESERVED2;
  __IOM uint32_t  CCR4;                         /*!< (@ 0x00000044) DMA channel x configuration register                       */
  __IOM uint32_t  CNDTR4;                       /*!< (@ 0x00000048) DMA channel x configuration register                       */
  __IOM uint32_t  CPAR4;                        /*!< (@ 0x0000004C) DMA channel x peripheral address register                  */
  __IOM uint32_t  CMAR4;                        /*!< (@ 0x00000050) DMA channel x memory address register                      */
  __IM  uint32_t  RESERVED3;
  __IOM uint32_t  CCR5;                         /*!< (@ 0x00000058) DMA channel x configuration register                       */
  __IOM uint32_t  CNDTR5;                       /*!< (@ 0x0000005C) DMA channel x configuration register                       */
  __IOM uint32_t  CPAR5;                        /*!< (@ 0x00000060) DMA channel x peripheral address register                  */
  __IOM uint32_t  CMAR5;                        /*!< (@ 0x00000064) DMA channel x memory address register                      */
} DMA_Type;                                     /*!< Size = 104 (0x68)                                                         */



/* =========================================================================================================================== */
/* ================                                          DMAMUX                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief DMAMUX (DMAMUX)
  */

