fduignan/stm32g030/include/STM32G030.h
typedef struct {                                /*!< (@ 0x40020800) DMAMUX Structure                                           */
  __IOM uint32_t  C0CR;                         /*!< (@ 0x00000000) DMAMux - DMA request line multiplexer channel
                                                                    x control register                                         */
  __IOM uint32_t  C1CR;                         /*!< (@ 0x00000004) DMAMux - DMA request line multiplexer channel
                                                                    x control register                                         */
  __IOM uint32_t  C2CR;                         /*!< (@ 0x00000008) DMAMux - DMA request line multiplexer channel
                                                                    x control register                                         */
  __IOM uint32_t  C3CR;                         /*!< (@ 0x0000000C) DMAMux - DMA request line multiplexer channel
                                                                    x control register                                         */
  __IOM uint32_t  C4CR;                         /*!< (@ 0x00000010) DMAMux - DMA request line multiplexer channel
                                                                    x control register                                         */
  __IOM uint32_t  C5CR;                         /*!< (@ 0x00000014) DMAMux - DMA request line multiplexer channel
                                                                    x control register                                         */
  __IOM uint32_t  C6CR;                         /*!< (@ 0x00000018) DMAMux - DMA request line multiplexer channel
                                                                    x control register                                         */
  __IM  uint32_t  RESERVED[57];
  __IOM uint32_t  RG0CR;                        /*!< (@ 0x00000100) DMAMux - DMA request generator channel x control
                                                                    register                                                   */
  __IOM uint32_t  RG1CR;                        /*!< (@ 0x00000104) DMAMux - DMA request generator channel x control
                                                                    register                                                   */
  __IOM uint32_t  RG2CR;                        /*!< (@ 0x00000108) DMAMux - DMA request generator channel x control
                                                                    register                                                   */
  __IOM uint32_t  RG3CR;                        /*!< (@ 0x0000010C) DMAMux - DMA request generator channel x control
                                                                    register                                                   */
  __IM  uint32_t  RESERVED1[12];
  __IM  uint32_t  RGSR;                         /*!< (@ 0x00000140) DMAMux - DMA request generator status register             */
  __OM  uint32_t  RGCFR;                        /*!< (@ 0x00000144) DMAMux - DMA request generator clear flag register         */
} DMAMUX_Type;                                  /*!< Size = 328 (0x148)                                                        */



/* =========================================================================================================================== */
/* ================                                           GPIOA                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief General-purpose I/Os (GPIOA)
  */

typedef struct {                                /*!< (@ 0x50000000) GPIOA Structure                                            */
  __IOM uint32_t  MODER;                        /*!< (@ 0x00000000) GPIO port mode register                                    */
  __IOM uint32_t  OTYPER;                       /*!< (@ 0x00000004) GPIO port output type register                             */
  __IOM uint32_t  OSPEEDR;                      /*!< (@ 0x00000008) GPIO port output speed register                            */
  __IOM uint32_t  PUPDR;                        /*!< (@ 0x0000000C) GPIO port pull-up/pull-down register                       */
  __IM  uint32_t  IDR;                          /*!< (@ 0x00000010) GPIO port input data register                              */
  __IOM uint32_t  ODR;                          /*!< (@ 0x00000014) GPIO port output data register                             */
  __OM  uint32_t  BSRR;                         /*!< (@ 0x00000018) GPIO port bit set/reset register                           */
  __IOM uint32_t  LCKR;                         /*!< (@ 0x0000001C) GPIO port configuration lock register                      */
  __IOM uint32_t  AFRL;                         /*!< (@ 0x00000020) GPIO alternate function low register                       */
  __IOM uint32_t  AFRH;                         /*!< (@ 0x00000024) GPIO alternate function high register                      */
  __OM  uint32_t  BRR;                          /*!< (@ 0x00000028) port bit reset register                                    */
} GPIOA_Type;                                   /*!< Size = 44 (0x2c)                                                          */



/* =========================================================================================================================== */
/* ================                                           GPIOB                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief General-purpose I/Os (GPIOB)
  */

typedef struct {                                /*!< (@ 0x50000400) GPIOB Structure                                            */
  __IOM uint32_t  MODER;                        /*!< (@ 0x00000000) GPIO port mode register                                    */
  __IOM uint32_t  OTYPER;                       /*!< (@ 0x00000004) GPIO port output type register                             */
  __IOM uint32_t  OSPEEDR;                      /*!< (@ 0x00000008) GPIO port output speed register                            */
  __IOM uint32_t  PUPDR;                        /*!< (@ 0x0000000C) GPIO port pull-up/pull-down register                       */
  __IM  uint32_t  IDR;                          /*!< (@ 0x00000010) GPIO port input data register                              */
  __IOM uint32_t  ODR;                          /*!< (@ 0x00000014) GPIO port output data register                             */
  __OM  uint32_t  BSRR;                         /*!< (@ 0x00000018) GPIO port bit set/reset register                           */
  __IOM uint32_t  LCKR;                         /*!< (@ 0x0000001C) GPIO port configuration lock register                      */
  __IOM uint32_t  AFRL;                         /*!< (@ 0x00000020) GPIO alternate function low register                       */
  __IOM uint32_t  AFRH;                         /*!< (@ 0x00000024) GPIO alternate function high register                      */
  __OM  uint32_t  BRR;                          /*!< (@ 0x00000028) port bit reset register                                    */
} GPIOB_Type;                                   /*!< Size = 44 (0x2c)                                                          */



/* =========================================================================================================================== */
/* ================                                            AES                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Advanced encryption standard hardware  accelerator 1 (AES)
  */

typedef struct {                                /*!< (@ 0x40026000) AES Structure                                              */
  __IOM uint32_t  CR;                           /*!< (@ 0x00000000) control register                                           */
  __IM  uint32_t  SR;                           /*!< (@ 0x00000004) status register                                            */
  __IOM uint32_t  DINR;                         /*!< (@ 0x00000008) data input register                                        */
  __IM  uint32_t  DOUTR;                        /*!< (@ 0x0000000C) data output register                                       */
  __IOM uint32_t  KEYR0;                        /*!< (@ 0x00000010) key register 0                                             */
  __IOM uint32_t  KEYR1;                        /*!< (@ 0x00000014) key register 1                                             */
  __IOM uint32_t  KEYR2;                        /*!< (@ 0x00000018) key register 2                                             */
  __IOM uint32_t  KEYR3;                        /*!< (@ 0x0000001C) key register 3                                             */
  __IOM uint32_t  IVR0;                         /*!< (@ 0x00000020) initialization vector register 0                           */
  __IOM uint32_t  IVR1;                         /*!< (@ 0x00000024) initialization vector register 1                           */
  __IOM uint32_t  IVR2;                         /*!< (@ 0x00000028) initialization vector register 2                           */
  __IOM uint32_t  IVR3;                         /*!< (@ 0x0000002C) initialization vector register 3                           */
  __IOM uint32_t  KEYR4;                        /*!< (@ 0x00000030) key register 4                                             */
  __IOM uint32_t  KEYR5;                        /*!< (@ 0x00000034) key register 5                                             */
  __IOM uint32_t  KEYR6;                        /*!< (@ 0x00000038) key register 6                                             */
  __IOM uint32_t  KEYR7;                        /*!< (@ 0x0000003C) key register 7                                             */
  __IOM uint32_t  SUSP0R;                       /*!< (@ 0x00000040) AES suspend register 0                                     */
  __IOM uint32_t  SUSP1R;                       /*!< (@ 0x00000044) AES suspend register 1                                     */
  __IOM uint32_t  SUSP2R;                       /*!< (@ 0x00000048) AES suspend register 2                                     */
  __IOM uint32_t  SUSP3R;                       /*!< (@ 0x0000004C) AES suspend register 3                                     */
  __IOM uint32_t  SUSP4R;                       /*!< (@ 0x00000050) AES suspend register 4                                     */
  __IOM uint32_t  SUSP5R;                       /*!< (@ 0x00000054) AES suspend register 5                                     */
  __IOM uint32_t  SUSP6R;                       /*!< (@ 0x00000058) AES suspend register 6                                     */
  __IOM uint32_t  SUSP7R;                       /*!< (@ 0x0000005C) AES suspend register 7                                     */
} AES_Type;                                     /*!< Size = 96 (0x60)                                                          */



/* =========================================================================================================================== */
/* ================                                            RNG                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Random number generator (RNG)
  */

typedef struct {                                /*!< (@ 0x40025000) RNG Structure                                              */
  __IOM uint32_t  CR;                           /*!< (@ 0x00000000) control register                                           */
  __IOM uint32_t  SR;                           /*!< (@ 0x00000004) status register                                            */
  __IM  uint32_t  DR;                           /*!< (@ 0x00000008) data register                                              */
} RNG_Type;                                     /*!< Size = 12 (0xc)                                                           */



/* =========================================================================================================================== */
/* ================                                            CRC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Cyclic redundancy check calculation  unit (CRC)
  */

typedef struct {                                /*!< (@ 0x40023000) CRC Structure                                              */
  __IOM uint32_t  DR;                           /*!< (@ 0x00000000) Data register                                              */
  __IOM uint32_t  IDR;                          /*!< (@ 0x00000004) Independent data register                                  */
  __IOM uint32_t  CR;                           /*!< (@ 0x00000008) Control register                                           */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  INIT;                         /*!< (@ 0x00000010) Initial CRC value                                          */
  __IOM uint32_t  POL;                          /*!< (@ 0x00000014) polynomial                                                 */
} CRC_Type;                                     /*!< Size = 24 (0x18)                                                          */



/* =========================================================================================================================== */
/* ================                                           EXTI                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief External interrupt/event  controller (EXTI)
  */

typedef struct {                                /*!< (@ 0x40021800) EXTI Structure                                             */
  __IOM uint32_t  RTSR1;                        /*!< (@ 0x00000000) EXTI rising trigger selection register                     */
  __IOM uint32_t  FTSR1;                        /*!< (@ 0x00000004) EXTI falling trigger selection register                    */
  __IOM uint32_t  SWIER1;                       /*!< (@ 0x00000008) EXTI software interrupt event register                     */
  __IOM uint32_t  RPR1;                         /*!< (@ 0x0000000C) EXTI rising edge pending register                          */
  __IOM uint32_t  FPR1;                         /*!< (@ 0x00000010) EXTI falling edge pending register                         */
  __IM  uint32_t  RESERVED[19];
  __IOM uint32_t  EXTICR1;                      /*!< (@ 0x00000060) EXTI external interrupt selection register                 */
  __IOM uint32_t  EXTICR2;                      /*!< (@ 0x00000064) EXTI external interrupt selection register                 */
  __IOM uint32_t  EXTICR3;                      /*!< (@ 0x00000068) EXTI external interrupt selection register                 */
  __IOM uint32_t  EXTICR4;                      /*!< (@ 0x0000006C) EXTI external interrupt selection register                 */
  __IM  uint32_t  RESERVED1[4];
  __IOM uint32_t  IMR1;                         /*!< (@ 0x00000080) EXTI CPU wakeup with interrupt mask register               */
  __IOM uint32_t  EMR1;                         /*!< (@ 0x00000084) EXTI CPU wakeup with event mask register                   */
} EXTI_Type;                                    /*!< Size = 136 (0x88)                                                         */



/* =========================================================================================================================== */
/* ================                                           TIM16                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief General purpose timers (TIM16)
  */

typedef struct {                                /*!< (@ 0x40014400) TIM16 Structure                                            */
  __IOM uint32_t  CR1;                          /*!< (@ 0x00000000) control register 1                                         */
  __IOM uint32_t  CR2;                          /*!< (@ 0x00000004) control register 2                                         */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  DIER;                         /*!< (@ 0x0000000C) DMA/Interrupt enable register                              */
  __IOM uint32_t  SR;                           /*!< (@ 0x00000010) status register                                            */
  __OM  uint32_t  EGR;                          /*!< (@ 0x00000014) event generation register                                  */
  
  union {
    __IOM uint32_t CCMR1_Output;                /*!< (@ 0x00000018) capture/compare mode register (output mode)                */
    __IOM uint32_t CCMR1_Input;                 /*!< (@ 0x00000018) capture/compare mode register 1 (input mode)               */
  };
  __IM  uint32_t  RESERVED1;
  __IOM uint32_t  CCER;                         /*!< (@ 0x00000020) capture/compare enable register                            */
  __IOM uint32_t  CNT;                          /*!< (@ 0x00000024) counter                                                    */
  __IOM uint32_t  PSC;                          /*!< (@ 0x00000028) prescaler                                                  */
  __IOM uint32_t  ARR;                          /*!< (@ 0x0000002C) auto-reload register                                       */
  __IOM uint32_t  RCR;                          /*!< (@ 0x00000030) repetition counter register                                */
  __IOM uint32_t  CCR1;                         /*!< (@ 0x00000034) capture/compare register 1                                 */
  __IM  uint32_t  RESERVED2[3];
  __IOM uint32_t  BDTR;                         /*!< (@ 0x00000044) break and dead-time register                               */
  __IOM uint32_t  DCR;                          /*!< (@ 0x00000048) DMA control register                                       */
  __IOM uint32_t  DMAR;                         /*!< (@ 0x0000004C) DMA address for full transfer                              */
  __IM  uint32_t  RESERVED3[4];
  __IOM uint32_t  AF1;                          /*!< (@ 0x00000060) TIM17 option register 1                                    */
  __IM  uint32_t  RESERVED4;
  __IOM uint32_t  TISEL;                        /*!< (@ 0x00000068) input selection register                                   */
} TIM16_Type;                                   /*!< Size = 108 (0x6c)                                                         */



/* =========================================================================================================================== */
/* ================                                          USART1                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Universal synchronous asynchronous receiver  transmitter (USART1)
  */

typedef struct {                                /*!< (@ 0x40013800) USART1 Structure                                           */
  __IOM uint32_t  CR1;                          /*!< (@ 0x00000000) Control register 1                                         */
  __IOM uint32_t  CR2;                          /*!< (@ 0x00000004) Control register 2                                         */
  __IOM uint32_t  CR3;                          /*!< (@ 0x00000008) Control register 3                                         */
  __IOM uint32_t  BRR;                          /*!< (@ 0x0000000C) Baud rate register                                         */
  __IOM uint32_t  GTPR;                         /*!< (@ 0x00000010) Guard time and prescaler register                          */
  __IOM uint32_t  RTOR;                         /*!< (@ 0x00000014) Receiver timeout register                                  */
  __OM  uint32_t  RQR;                          /*!< (@ 0x00000018) Request register                                           */
  __IM  uint32_t  ISR;                          /*!< (@ 0x0000001C) Interrupt & status register                                */
  __OM  uint32_t  ICR;                          /*!< (@ 0x00000020) Interrupt flag clear register                              */
  __IM  uint32_t  RDR;                          /*!< (@ 0x00000024) Receive data register                                      */
  __IOM uint32_t  TDR;                          /*!< (@ 0x00000028) Transmit data register                                     */
  __IOM uint32_t  PRESC;                        /*!< (@ 0x0000002C) Prescaler register                                         */
} USART1_Type;                                  /*!< Size = 48 (0x30)                                                          */



/* =========================================================================================================================== */
/* ================                                           SPI1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Serial peripheral interface/Inter-IC  sound (SPI1)
  */

