fduignan/stm32g030/include/STM32G030.h
typedef struct {                                /*!< (@ 0x40013000) SPI1 Structure                                             */
  __IOM uint32_t  CR1;                          /*!< (@ 0x00000000) control register 1                                         */
  __IOM uint32_t  CR2;                          /*!< (@ 0x00000004) control register 2                                         */
  __IOM uint32_t  SR;                           /*!< (@ 0x00000008) status register                                            */
  __IOM uint32_t  DR;                           /*!< (@ 0x0000000C) data register                                              */
  __IOM uint32_t  CRCPR;                        /*!< (@ 0x00000010) CRC polynomial register                                    */
  __IM  uint32_t  RXCRCR;                       /*!< (@ 0x00000014) RX CRC register                                            */
  __IM  uint32_t  TXCRCR;                       /*!< (@ 0x00000018) TX CRC register                                            */
  __IOM uint32_t  I2SCFGR;                      /*!< (@ 0x0000001C) configuration register                                     */
  __IOM uint32_t  I2SPR;                        /*!< (@ 0x00000020) prescaler register                                         */
} SPI1_Type;                                    /*!< Size = 36 (0x24)                                                          */



/* =========================================================================================================================== */
/* ================                                           TIM1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Advanced-timers (TIM1)
  */

typedef struct {                                /*!< (@ 0x40012C00) TIM1 Structure                                             */
  __IOM uint32_t  CR1;                          /*!< (@ 0x00000000) control register 1                                         */
  __IOM uint32_t  CR2;                          /*!< (@ 0x00000004) control register 2                                         */
  __IOM uint32_t  SMCR;                         /*!< (@ 0x00000008) slave mode control register                                */
  __IOM uint32_t  DIER;                         /*!< (@ 0x0000000C) DMA/Interrupt enable register                              */
  __IOM uint32_t  SR;                           /*!< (@ 0x00000010) status register                                            */
  __OM  uint32_t  EGR;                          /*!< (@ 0x00000014) event generation register                                  */
  
  union {
    __IOM uint32_t CCMR1_Output;                /*!< (@ 0x00000018) capture/compare mode register 1 (output mode)              */
    __IOM uint32_t CCMR1_Input;                 /*!< (@ 0x00000018) capture/compare mode register 1 (output mode)              */
  };
  
  union {
    __IOM uint32_t CCMR2_Output;                /*!< (@ 0x0000001C) capture/compare mode register 2 (output mode)              */
    __IOM uint32_t CCMR2_Input;                 /*!< (@ 0x0000001C) capture/compare mode register 2 (output mode)              */
  };
  __IOM uint32_t  CCER;                         /*!< (@ 0x00000020) capture/compare enable register                            */
  __IOM uint32_t  CNT;                          /*!< (@ 0x00000024) counter                                                    */
  __IOM uint32_t  PSC;                          /*!< (@ 0x00000028) prescaler                                                  */
  __IOM uint32_t  ARR;                          /*!< (@ 0x0000002C) auto-reload register                                       */
  __IOM uint32_t  RCR;                          /*!< (@ 0x00000030) repetition counter register                                */
  __IOM uint32_t  CCR1;                         /*!< (@ 0x00000034) capture/compare register 1                                 */
  __IOM uint32_t  CCR2;                         /*!< (@ 0x00000038) capture/compare register 2                                 */
  __IOM uint32_t  CCR3;                         /*!< (@ 0x0000003C) capture/compare register 3                                 */
  __IOM uint32_t  CCR4;                         /*!< (@ 0x00000040) capture/compare register 4                                 */
  __IOM uint32_t  BDTR;                         /*!< (@ 0x00000044) break and dead-time register                               */
  __IOM uint32_t  DCR;                          /*!< (@ 0x00000048) DMA control register                                       */
  __IOM uint32_t  DMAR;                         /*!< (@ 0x0000004C) DMA address for full transfer                              */
  __IOM uint32_t  OR1;                          /*!< (@ 0x00000050) option register 1                                          */
  __IOM uint32_t  CCMR3_Output;                 /*!< (@ 0x00000054) capture/compare mode register 2 (output mode)              */
  __IOM uint32_t  CCR5;                         /*!< (@ 0x00000058) capture/compare register 4                                 */
  __IOM uint32_t  CCR6;                         /*!< (@ 0x0000005C) capture/compare register 4                                 */
  __IOM uint32_t  AF1;                          /*!< (@ 0x00000060) DMA address for full transfer                              */
  __IOM uint32_t  AF2;                          /*!< (@ 0x00000064) DMA address for full transfer                              */
  __IOM uint32_t  TISEL;                        /*!< (@ 0x00000068) TIM1 timer input selection register                        */
} TIM1_Type;                                    /*!< Size = 108 (0x6c)                                                         */



/* =========================================================================================================================== */
/* ================                                            ADC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Analog to Digital Converter instance  1 (ADC)
  */

typedef struct {                                /*!< (@ 0x40012400) ADC Structure                                              */
  __IOM uint32_t  ISR;                          /*!< (@ 0x00000000) ADC interrupt and status register                          */
  __IOM uint32_t  IER;                          /*!< (@ 0x00000004) ADC interrupt enable register                              */
  __IOM uint32_t  CR;                           /*!< (@ 0x00000008) ADC control register                                       */
  __IOM uint32_t  CFGR1;                        /*!< (@ 0x0000000C) ADC configuration register 1                               */
  __IOM uint32_t  CFGR2;                        /*!< (@ 0x00000010) ADC configuration register 2                               */
  __IOM uint32_t  SMPR;                         /*!< (@ 0x00000014) ADC sampling time register                                 */
  __IM  uint32_t  RESERVED[2];
  __IOM uint32_t  AWD1TR;                       /*!< (@ 0x00000020) watchdog threshold register                                */
  __IOM uint32_t  AWD2TR;                       /*!< (@ 0x00000024) watchdog threshold register                                */
  
  union {
    __IOM uint32_t CHSELR;                      /*!< (@ 0x00000028) channel selection register                                 */
    __IOM uint32_t CHSELR_1;                    /*!< (@ 0x00000028) channel selection register CHSELRMOD = 1 in ADC_CFGR1      */
  };
  __IOM uint32_t  AWD3TR;                       /*!< (@ 0x0000002C) watchdog threshold register                                */
  __IM  uint32_t  RESERVED1[4];
  __IM  uint32_t  DR;                           /*!< (@ 0x00000040) ADC group regular conversion data register                 */
  __IM  uint32_t  RESERVED2[23];
  __IOM uint32_t  AWD2CR;                       /*!< (@ 0x000000A0) ADC analog watchdog 2 configuration register               */
  __IOM uint32_t  AWD3CR;                       /*!< (@ 0x000000A4) ADC analog watchdog 3 configuration register               */
  __IM  uint32_t  RESERVED3[3];
  __IOM uint32_t  CALFACT;                      /*!< (@ 0x000000B4) ADC calibration factors register                           */
  __IM  uint32_t  RESERVED4[148];
  __IOM uint32_t  CCR;                          /*!< (@ 0x00000308) ADC common control register                                */
} ADC_Type;                                     /*!< Size = 780 (0x30c)                                                        */



/* =========================================================================================================================== */
/* ================                                          SYSCFG                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief System configuration controller (SYSCFG)
  */

typedef struct {                                /*!< (@ 0x40010000) SYSCFG Structure                                           */
  __IOM uint32_t  CFGR1;                        /*!< (@ 0x00000000) SYSCFG configuration register 1                            */
  __IM  uint32_t  RESERVED[5];
  __IOM uint32_t  CFGR2;                        /*!< (@ 0x00000018) SYSCFG configuration register 1                            */
} SYSCFG_Type;                                  /*!< Size = 28 (0x1c)                                                          */



/* =========================================================================================================================== */
/* ================                                           TAMP                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Tamper and backup registers (TAMP)
  */

