fduignan/stm32g030/include/STM32G030.h
typedef struct {                                /*!< (@ 0x4000B000) TAMP Structure                                             */
  __IOM uint32_t  CR1;                          /*!< (@ 0x00000000) control register 1                                         */
  __IOM uint32_t  CR2;                          /*!< (@ 0x00000004) control register 2                                         */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  FLTCR;                        /*!< (@ 0x0000000C) TAMP filter control register                               */
  __IM  uint32_t  RESERVED1[7];
  __IOM uint32_t  IER;                          /*!< (@ 0x0000002C) TAMP interrupt enable register                             */
  __IM  uint32_t  SR;                           /*!< (@ 0x00000030) TAMP status register                                       */
  __IM  uint32_t  MISR;                         /*!< (@ 0x00000034) TAMP masked interrupt status register                      */
  __IM  uint32_t  RESERVED2;
  __OM  uint32_t  SCR;                          /*!< (@ 0x0000003C) TAMP status clear register                                 */
  __IM  uint32_t  RESERVED3[48];
  __IOM uint32_t  BKP0R;                        /*!< (@ 0x00000100) TAMP backup register                                       */
  __IOM uint32_t  BKP1R;                        /*!< (@ 0x00000104) TAMP backup register                                       */
  __IOM uint32_t  BKP2R;                        /*!< (@ 0x00000108) TAMP backup register                                       */
  __IOM uint32_t  BKP3R;                        /*!< (@ 0x0000010C) TAMP backup register                                       */
  __IOM uint32_t  BKP4R;                        /*!< (@ 0x00000110) TAMP backup register                                       */
} TAMP_Type;                                    /*!< Size = 276 (0x114)                                                        */



/* =========================================================================================================================== */
/* ================                                          LPTIM1                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Low power timer (LPTIM1)
  */

typedef struct {                                /*!< (@ 0x40007C00) LPTIM1 Structure                                           */
  __IM  uint32_t  ISR;                          /*!< (@ 0x00000000) Interrupt and Status Register                              */
  __OM  uint32_t  ICR;                          /*!< (@ 0x00000004) Interrupt Clear Register                                   */
  __IOM uint32_t  IER;                          /*!< (@ 0x00000008) Interrupt Enable Register                                  */
  __IOM uint32_t  CFGR;                         /*!< (@ 0x0000000C) Configuration Register                                     */
  __IOM uint32_t  CR;                           /*!< (@ 0x00000010) Control Register                                           */
  __IOM uint32_t  CMP;                          /*!< (@ 0x00000014) Compare Register                                           */
  __IOM uint32_t  ARR;                          /*!< (@ 0x00000018) Autoreload Register                                        */
  __IM  uint32_t  CNT;                          /*!< (@ 0x0000001C) Counter Register                                           */
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  CFGR2;                        /*!< (@ 0x00000024) LPTIM configuration register 2                             */
} LPTIM1_Type;                                  /*!< Size = 40 (0x28)                                                          */



/* =========================================================================================================================== */
/* ================                                          LPUART                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Universal synchronous asynchronous receiver  transmitter (LPUART)
  */

typedef struct {                                /*!< (@ 0x40008000) LPUART Structure                                           */
  __IOM uint32_t  CR1;                          /*!< (@ 0x00000000) Control register 1                                         */
  __IOM uint32_t  CR2;                          /*!< (@ 0x00000004) Control register 2                                         */
  __IOM uint32_t  CR3;                          /*!< (@ 0x00000008) Control register 3                                         */
  __IOM uint32_t  BRR;                          /*!< (@ 0x0000000C) Baud rate register                                         */
  __IM  uint32_t  RESERVED[2];
  __OM  uint32_t  RQR;                          /*!< (@ 0x00000018) Request register                                           */
  __IM  uint32_t  ISR;                          /*!< (@ 0x0000001C) Interrupt & status register                                */
  __OM  uint32_t  ICR;                          /*!< (@ 0x00000020) Interrupt flag clear register                              */
  __IM  uint32_t  RDR;                          /*!< (@ 0x00000024) Receive data register                                      */
  __IOM uint32_t  TDR;                          /*!< (@ 0x00000028) Transmit data register                                     */
  __IOM uint32_t  PRESC;                        /*!< (@ 0x0000002C) Prescaler register                                         */
} LPUART_Type;                                  /*!< Size = 48 (0x30)                                                          */



/* =========================================================================================================================== */
/* ================                                           I2C1                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Inter-integrated circuit (I2C1)
  */

