fduignan/stm32g030/include/STM32G030.h
typedef struct {                                /*!< (@ 0x40010030) VREFBUF Structure                                          */
  __IOM uint32_t  CSR;                          /*!< (@ 0x00000000) VREFBUF control and status register                        */
  __IOM uint32_t  CCR;                          /*!< (@ 0x00000004) VREFBUF calibration control register                       */
} VREFBUF_Type;                                 /*!< Size = 8 (0x8)                                                            */



/* =========================================================================================================================== */
/* ================                                            DBG                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief MCU debug component (DBG)
  */

typedef struct {                                /*!< (@ 0x40015800) DBG Structure                                              */
  __IM  uint32_t  IDCODE;                       /*!< (@ 0x00000000) DBGMCU_IDCODE                                              */
  __IOM uint32_t  CR;                           /*!< (@ 0x00000004) Debug MCU configuration register                           */
  __IOM uint32_t  APB_FZ1;                      /*!< (@ 0x00000008) Debug MCU APB1 freeze register1                            */
  __IOM uint32_t  APB_FZ2;                      /*!< (@ 0x0000000C) Debug MCU APB1 freeze register 2                           */
} DBG_Type;                                     /*!< Size = 16 (0x10)                                                          */



/* =========================================================================================================================== */
/* ================                                         NVIC_STIR                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief Nested vectored interrupt  controller (NVIC_STIR)
  */

typedef struct {                                /*!< (@ 0xE000EF00) NVIC_STIR Structure                                        */
  __IOM uint32_t  STIR;                         /*!< (@ 0x00000000) Software trigger interrupt register                        */
} NVIC_STIR_Type;                               /*!< Size = 4 (0x4)                                                            */



/* =========================================================================================================================== */
/* ================                                         SCB_ACTRL                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief System control block ACTLR (SCB_ACTRL)
  */

typedef struct {                                /*!< (@ 0xE000E008) SCB_ACTRL Structure                                        */
  __IOM uint32_t  ACTRL;                        /*!< (@ 0x00000000) Auxiliary control register                                 */
} SCB_ACTRL_Type;                               /*!< Size = 4 (0x4)                                                            */



/* =========================================================================================================================== */
/* ================                                         FPU_CPACR                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief Floating point unit CPACR (FPU_CPACR)
  */

typedef struct {                                /*!< (@ 0xE000ED88) FPU_CPACR Structure                                        */
  __IOM uint32_t  CPACR;                        /*!< (@ 0x00000000) Coprocessor access control register                        */
} FPU_CPACR_Type;                               /*!< Size = 4 (0x4)                                                            */



/* =========================================================================================================================== */
/* ================                                            FPU                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Floting point unit (FPU)
  */

typedef struct {                                /*!< (@ 0xE000EF34) FPU Structure                                              */
  __IOM uint32_t  FPCCR;                        /*!< (@ 0x00000000) Floating-point context control register                    */
  __IOM uint32_t  FPCAR;                        /*!< (@ 0x00000004) Floating-point context address register                    */
  __IOM uint32_t  FPSCR;                        /*!< (@ 0x00000008) Floating-point status control register                     */
} FPU_Type;                                     /*!< Size = 12 (0xc)                                                           */



/* =========================================================================================================================== */
/* ================                                       SYSCFG_ITLINE                                       ================ */
/* =========================================================================================================================== */


/**
  * @brief System configuration controller (SYSCFG_ITLINE)
  */

typedef struct {                                /*!< (@ 0x40010080) SYSCFG_ITLINE Structure                                    */
  __IM  uint32_t  RESERVED[32];
  __IM  uint32_t  ITLINE0;                      /*!< (@ 0x00000080) interrupt line 0 status register                           */
  __IM  uint32_t  ITLINE1;                      /*!< (@ 0x00000084) interrupt line 1 status register                           */
  __IM  uint32_t  ITLINE2;                      /*!< (@ 0x00000088) interrupt line 2 status register                           */
  __IM  uint32_t  ITLINE3;                      /*!< (@ 0x0000008C) interrupt line 3 status register                           */
  __IM  uint32_t  ITLINE4;                      /*!< (@ 0x00000090) interrupt line 4 status register                           */
  __IM  uint32_t  ITLINE5;                      /*!< (@ 0x00000094) interrupt line 5 status register                           */
  __IM  uint32_t  ITLINE6;                      /*!< (@ 0x00000098) interrupt line 6 status register                           */
  __IM  uint32_t  ITLINE7;                      /*!< (@ 0x0000009C) interrupt line 7 status register                           */
  __IM  uint32_t  RESERVED1;
  __IM  uint32_t  ITLINE9;                      /*!< (@ 0x000000A4) interrupt line 9 status register                           */
  __IM  uint32_t  ITLINE10;                     /*!< (@ 0x000000A8) interrupt line 10 status register                          */
  __IM  uint32_t  ITLINE11;                     /*!< (@ 0x000000AC) interrupt line 11 status register                          */
  __IM  uint32_t  ITLINE12;                     /*!< (@ 0x000000B0) interrupt line 12 status register                          */
  __IM  uint32_t  ITLINE13;                     /*!< (@ 0x000000B4) interrupt line 13 status register                          */
  __IM  uint32_t  ITLINE14;                     /*!< (@ 0x000000B8) interrupt line 14 status register                          */
  __IM  uint32_t  ITLINE15;                     /*!< (@ 0x000000BC) interrupt line 15 status register                          */
  __IM  uint32_t  ITLINE16;                     /*!< (@ 0x000000C0) interrupt line 16 status register                          */
  __IM  uint32_t  ITLINE17;                     /*!< (@ 0x000000C4) interrupt line 17 status register                          */
  __IM  uint32_t  ITLINE18;                     /*!< (@ 0x000000C8) interrupt line 18 status register                          */
  __IM  uint32_t  ITLINE19;                     /*!< (@ 0x000000CC) interrupt line 19 status register                          */
  __IM  uint32_t  RESERVED2;
  __IM  uint32_t  ITLINE21;                     /*!< (@ 0x000000D4) interrupt line 21 status register                          */
  __IM  uint32_t  ITLINE22;                     /*!< (@ 0x000000D8) interrupt line 22 status register                          */
  __IM  uint32_t  ITLINE23;                     /*!< (@ 0x000000DC) interrupt line 23 status register                          */
  __IM  uint32_t  ITLINE24;                     /*!< (@ 0x000000E0) interrupt line 24 status register                          */
  __IM  uint32_t  ITLINE25;                     /*!< (@ 0x000000E4) interrupt line 25 status register                          */
  __IM  uint32_t  ITLINE26;                     /*!< (@ 0x000000E8) interrupt line 26 status register                          */
  __IM  uint32_t  ITLINE27;                     /*!< (@ 0x000000EC) interrupt line 27 status register                          */
  __IM  uint32_t  ITLINE28;                     /*!< (@ 0x000000F0) interrupt line 28 status register                          */
  __IM  uint32_t  ITLINE29;                     /*!< (@ 0x000000F4) interrupt line 29 status register                          */
  __IM  uint32_t  RESERVED3;
  __IM  uint32_t  ITLINE31;                     /*!< (@ 0x000000FC) interrupt line 31 status register                          */
} SYSCFG_ITLINE_Type;                           /*!< Size = 256 (0x100)                                                        */


