fduignan/stm32g030/include/STM32G030.h
/** @} */ /* End of group Device_Peripheral_peripherals */


/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripheralAddr
  * @{
  */

#define IWDG_BASE                   0x40003000UL
#define WWDG_BASE                   0x40002C00UL
#define FLASH_BASE                  0x40022000UL
#define RCC_BASE                    0x40021000UL
#define PWR_BASE                    0x40007000UL
#define DMA_BASE                    0x40020000UL
#define DMAMUX_BASE                 0x40020800UL
#define GPIOA_BASE                  0x50000000UL
#define GPIOB_BASE                  0x50000400UL
#define GPIOC_BASE                  0x50000800UL
#define GPIOD_BASE                  0x50000C00UL
#define GPIOF_BASE                  0x50001400UL
#define AES_BASE                    0x40026000UL
#define RNG_BASE                    0x40025000UL
#define CRC_BASE                    0x40023000UL
#define EXTI_BASE                   0x40021800UL
#define TIM16_BASE                  0x40014400UL
#define TIM17_BASE                  0x40014800UL
#define USART1_BASE                 0x40013800UL
#define USART2_BASE                 0x40004400UL
#define SPI1_BASE                   0x40013000UL
#define SPI2_BASE                   0x40003800UL
#define TIM1_BASE                   0x40012C00UL
#define ADC_BASE                    0x40012400UL
#define SYSCFG_BASE                 0x40010000UL
#define TAMP_BASE                   0x4000B000UL
#define LPTIM1_BASE                 0x40007C00UL
#define LPTIM2_BASE                 0x40009400UL
#define LPUART_BASE                 0x40008000UL
#define I2C1_BASE                   0x40005400UL
#define I2C2_BASE                   0x40005800UL
#define RTC_BASE                    0x40002800UL
#define TIM14_BASE                  0x40002000UL
#define TIM2_BASE                   0x40000000UL
#define TIM3_BASE                   0x40000400UL
#define NVIC_BASE                   0xE000E100UL
#define MPU_BASE                    0xE000ED90UL
#define STK_BASE                    0xE000E010UL
#define SCB_BASE                    0xE000ED00UL
#define VREFBUF_BASE                0x40010030UL
#define DBG_BASE                    0x40015800UL
#define NVIC_STIR_BASE              0xE000EF00UL
#define SCB_ACTRL_BASE              0xE000E008UL
#define FPU_CPACR_BASE              0xE000ED88UL
#define FPU_BASE                    0xE000EF34UL
#define SYSCFG_ITLINE_BASE          0x40010080UL

/** @} */ /* End of group Device_Peripheral_peripheralAddr */


/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_declaration
  * @{
  */

#define IWDG                        ((IWDG_Type*)              IWDG_BASE)
#define WWDG                        ((WWDG_Type*)              WWDG_BASE)
#define FLASH                       ((FLASH_Type*)             FLASH_BASE)
#define RCC                         ((RCC_Type*)               RCC_BASE)
#define PWR                         ((PWR_Type*)               PWR_BASE)
#define DMA                         ((DMA_Type*)               DMA_BASE)
#define DMAMUX                      ((DMAMUX_Type*)            DMAMUX_BASE)
#define GPIOA                       ((GPIOA_Type*)             GPIOA_BASE)
#define GPIOB                       ((GPIOB_Type*)             GPIOB_BASE)
#define GPIOC                       ((GPIOB_Type*)             GPIOC_BASE)
#define GPIOD                       ((GPIOB_Type*)             GPIOD_BASE)
#define GPIOF                       ((GPIOB_Type*)             GPIOF_BASE)
#define AES                         ((AES_Type*)               AES_BASE)
#define RNG                         ((RNG_Type*)               RNG_BASE)
#define CRC                         ((CRC_Type*)               CRC_BASE)
#define EXTI                        ((EXTI_Type*)              EXTI_BASE)
#define TIM16                       ((TIM16_Type*)             TIM16_BASE)
#define TIM17                       ((TIM16_Type*)             TIM17_BASE)
#define USART1                      ((USART1_Type*)            USART1_BASE)
#define USART2                      ((USART1_Type*)            USART2_BASE)
#define SPI1                        ((SPI1_Type*)              SPI1_BASE)
#define SPI2                        ((SPI1_Type*)              SPI2_BASE)
#define TIM1                        ((TIM1_Type*)              TIM1_BASE)
#define ADC                         ((ADC_Type*)               ADC_BASE)
#define SYSCFG                      ((SYSCFG_Type*)            SYSCFG_BASE)
#define TAMP                        ((TAMP_Type*)              TAMP_BASE)
#define LPTIM1                      ((LPTIM1_Type*)            LPTIM1_BASE)
#define LPTIM2                      ((LPTIM1_Type*)            LPTIM2_BASE)
#define LPUART                      ((LPUART_Type*)            LPUART_BASE)
#define I2C1                        ((I2C1_Type*)              I2C1_BASE)
#define I2C2                        ((I2C1_Type*)              I2C2_BASE)
#define RTC                         ((RTC_Type*)               RTC_BASE)
#define TIM14                       ((TIM14_Type*)             TIM14_BASE)
#define TIM2                        ((TIM2_Type*)              TIM2_BASE)
#define TIM3                        ((TIM2_Type*)              TIM3_BASE)
#define NVIC                        ((NVIC_Type*)              NVIC_BASE)
#define MPU                         ((MPU_Type*)               MPU_BASE)
#define STK                         ((STK_Type*)               STK_BASE)
#define SCB                         ((SCB_Type*)               SCB_BASE)
#define VREFBUF                     ((VREFBUF_Type*)           VREFBUF_BASE)
#define DBG                         ((DBG_Type*)               DBG_BASE)
#define NVIC_STIR                   ((NVIC_STIR_Type*)         NVIC_STIR_BASE)
#define SCB_ACTRL                   ((SCB_ACTRL_Type*)         SCB_ACTRL_BASE)
#define FPU_CPACR                   ((FPU_CPACR_Type*)         FPU_CPACR_BASE)
#define FPU                         ((FPU_Type*)               FPU_BASE)
#define SYSCFG_ITLINE               ((SYSCFG_ITLINE_Type*)     SYSCFG_ITLINE_BASE)

/** @} */ /* End of group Device_Peripheral_declaration */


/* =========================================  End of section using anonymous unions  ========================================= */
#if defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#endif


#ifdef __cplusplus
}
#endif

#endif /* STM32G030_H */


/** @} */ /* End of group STM32G030 */

/** @} */ /* End of group  */
